#### `terragrunt run-all plan` Failed
<details><summary>Show Output</summary>

```
Refreshing Terraform state in-memory prior to plan...
The refreshed state will be used to calculate this plan, but will not be
persisted to local or remote state storage.

Refreshing Terraform state in-memory prior to plan...
The refreshed state will be used to calculate this plan, but will not be
persisted to local or remote state storage.

Refreshing Terraform state in-memory prior to plan...
The refreshed state will be used to calculate this plan, but will not be
persisted to local or remote state storage.

google_folder.this: Refreshing state... [id=folders/798510137680]
google_folder.this: Refreshing state... [id=folders/629879808314]
google_folder.this: Refreshing state... [id=folders/714282602549]

------------------------------------------------------------------------

------------------------------------------------------------------------

------------------------------------------------------------------------

No changes. Infrastructure is up-to-date.

This means that Terraform did not detect any differences between your
configuration and real physical resources that exist. As a result, no
actions need to be performed.

No changes. Infrastructure is up-to-date.

This means that Terraform did not detect any differences between your
configuration and real physical resources that exist. As a result, no
actions need to be performed.

No changes. Infrastructure is up-to-date.

This means that Terraform did not detect any differences between your
configuration and real physical resources that exist. As a result, no
actions need to be performed.
Refreshing Terraform state in-memory prior to plan...
The refreshed state will be used to calculate this plan, but will not be
persisted to local or remote state storage.

Refreshing Terraform state in-memory prior to plan...
The refreshed state will be used to calculate this plan, but will not be
persisted to local or remote state storage.

Refreshing Terraform state in-memory prior to plan...
The refreshed state will be used to calculate this plan, but will not be
persisted to local or remote state storage.

Refreshing Terraform state in-memory prior to plan...
The refreshed state will be used to calculate this plan, but will not be
persisted to local or remote state storage.

Refreshing Terraform state in-memory prior to plan...
The refreshed state will be used to calculate this plan, but will not be
persisted to local or remote state storage.

Refreshing Terraform state in-memory prior to plan...
The refreshed state will be used to calculate this plan, but will not be
persisted to local or remote state storage.

google_folder.this: Refreshing state... [id=folders/430824589187]
google_folder.this: Refreshing state... [id=folders/692745425625]
google_folder.this: Refreshing state... [id=folders/34959545008]

------------------------------------------------------------------------
google_folder.env: Refreshing state... [id=folders/605914450685]
google_folder.env: Refreshing state... [id=folders/512817110928]

------------------------------------------------------------------------
google_folder.env: Refreshing state... [id=folders/978739234566]

------------------------------------------------------------------------
google_project.env: Refreshing state... [id=projects/bon-transport-dev-007]

No changes. Infrastructure is up-to-date.

This means that Terraform did not detect any differences between your
configuration and real physical resources that exist. As a result, no
actions need to be performed.
google_project.env: Refreshing state... [id=projects/bon-transport-stg-007]
google_project.env: Refreshing state... [id=projects/bon-transport-prd-007]

No changes. Infrastructure is up-to-date.

This means that Terraform did not detect any differences between your
configuration and real physical resources that exist. As a result, no
actions need to be performed.

No changes. Infrastructure is up-to-date.

This means that Terraform did not detect any differences between your
configuration and real physical resources that exist. As a result, no
actions need to be performed.
google_project_service.api["iamcredentials"]: Refreshing state... [id=bon-transport-dev-007/iamcredentials.googleapis.com]
google_project_service.api["logging"]: Refreshing state... [id=bon-transport-dev-007/logging.googleapis.com]
google_project_service.api["monitoring"]: Refreshing state... [id=bon-transport-dev-007/monitoring.googleapis.com]
google_project_service.api["logging"]: Refreshing state... [id=bon-transport-prd-007/logging.googleapis.com]
google_project_service.api["iamcredentials"]: Refreshing state... [id=bon-transport-prd-007/iamcredentials.googleapis.com]
google_project_service.api["monitoring"]: Refreshing state... [id=bon-transport-prd-007/monitoring.googleapis.com]
google_project_service.api["iamcredentials"]: Refreshing state... [id=bon-transport-stg-007/iamcredentials.googleapis.com]
google_project_service.api["monitoring"]: Refreshing state... [id=bon-transport-stg-007/monitoring.googleapis.com]
google_project_service.api["logging"]: Refreshing state... [id=bon-transport-stg-007/logging.googleapis.com]
module.vpc.module.vpc.google_compute_network.network: Refreshing state... [id=projects/bon-transport-dev-007/global/networks/transport-dev]

Warning: Interpolation-only expressions are deprecated

  on .terraform/modules/vpc/modules/firewall-rules/main.tf line 18, in resource "google_compute_firewall" "rules":
  18:   for_each                = { for r in var.rules : "${r.name}" => r }

Terraform 0.11 and earlier required all non-constant expressions to be
provided via interpolation syntax, but this pattern is now deprecated. To
silence this warning, remove the "${ sequence from the start and the }"
sequence from the end of this expression, leaving just the inner expression.

Template interpolation syntax is still used to construct strings from
expressions when the template includes multiple interpolation sequences or a
mixture of literal strings and interpolations. This deprecation applies only
to templates that consist entirely of a single interpolation sequence.

time=2021-02-15T18:05:16Z level=error msg=Dependency /github/workspace/transport/dev of module /github/workspace/dept/squad-b/dev just finished with an error. Module /github/workspace/dept/squad-b/dev will have to return an error too. prefix=[/github/workspace/dept/squad-b/dev] 
time=2021-02-15T18:05:16Z level=error msg=Dependency /github/workspace/transport/dev of module /github/workspace/dept/squad-c/dev just finished with an error. Module /github/workspace/dept/squad-c/dev will have to return an error too. prefix=[/github/workspace/dept/squad-c/dev] 
time=2021-02-15T18:05:16Z level=error msg=Dependency /github/workspace/transport/dev of module /github/workspace/dept/squad-a/dev just finished with an error. Module /github/workspace/dept/squad-a/dev will have to return an error too. prefix=[/github/workspace/dept/squad-a/dev] 

------------------------------------------------------------------------
module.vpc.module.vpc.google_compute_network.network: Refreshing state... [id=projects/bon-transport-prd-007/global/networks/transport-prd]

Warning: Interpolation-only expressions are deprecated

  on .terraform/modules/vpc/modules/firewall-rules/main.tf line 18, in resource "google_compute_firewall" "rules":
  18:   for_each                = { for r in var.rules : "${r.name}" => r }

Terraform 0.11 and earlier required all non-constant expressions to be
provided via interpolation syntax, but this pattern is now deprecated. To
silence this warning, remove the "${ sequence from the start and the }"
sequence from the end of this expression, leaving just the inner expression.

Template interpolation syntax is still used to construct strings from
expressions when the template includes multiple interpolation sequences or a
mixture of literal strings and interpolations. This deprecation applies only
to templates that consist entirely of a single interpolation sequence.


An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # google_compute_ha_vpn_gateway.this will be created
  + resource "google_compute_ha_vpn_gateway" "this" {
      + id             = (known after apply)
      + name           = "transport-stg"
      + network        = "transport-stg"
      + project        = "bon-transport-stg-07"
      + region         = (known after apply)
      + self_link      = (known after apply)
      + vpn_interfaces = (known after apply)
    }

  # google_compute_router.this will be created
  + resource "google_compute_router" "this" {
      + creation_timestamp = (known after apply)
      + id                 = (known after apply)
      + name               = "transport-stg"
      + network            = "transport-stg"
      + project            = "bon-transport-stg-07"
      + region             = (known after apply)
      + self_link          = (known after apply)

      + bgp {
          + advertise_mode    = "CUSTOM"
          + advertised_groups = []
          + asn               = 64513

          + advertised_ip_ranges {
              + range = "10.0.4.0/22"
            }
        }
    }

  # google_project.env must be replaced
-/+ resource "google_project" "env" {
        auto_create_network = false
        billing_account     = "01473C-EEB311-01F68E"
        folder_id           = "512817110928"
      ~ id                  = "projects/bon-transport-stg-007" -> (known after apply)
      - labels              = {} -> null
        name                = "bon-transport-stg"
      ~ number              = "31071066476" -> (known after apply)
      + org_id              = (known after apply)
      ~ project_id          = "bon-transport-stg-007" -> "bon-transport-stg-07" # forces replacement
      + skip_delete         = (known after apply)
    }

  # google_project_service.api["cloudbilling"] will be created
  + resource "google_project_service" "api" {
      + disable_dependent_services = true
      + disable_on_destroy         = true
      + id                         = (known after apply)
      + project                    = "bon-transport-stg-07"
      + service                    = "cloudbilling.googleapis.com"
    }

  # google_project_service.api["cloudresourcemanager"] will be created
  + resource "google_project_service" "api" {
      + disable_dependent_services = true
      + disable_on_destroy         = true
      + id                         = (known after apply)
      + project                    = "bon-transport-stg-07"
      + service                    = "cloudresourcemanager.googleapis.com"
    }

  # google_project_service.api["compute"] will be created
  + resource "google_project_service" "api" {
      + disable_dependent_services = true
      + disable_on_destroy         = true
      + id                         = (known after apply)
      + project                    = "bon-transport-stg-07"
      + service                    = "compute.googleapis.com"
    }

  # google_project_service.api["dns"] will be created
  + resource "google_project_service" "api" {
      + disable_dependent_services = true
      + disable_on_destroy         = true
      + id                         = (known after apply)
      + project                    = "bon-transport-stg-07"
      + service                    = "dns.googleapis.com"
    }

  # google_project_service.api["iam"] will be created
  + resource "google_project_service" "api" {
      + disable_dependent_services = true
      + disable_on_destroy         = true
      + id                         = (known after apply)
      + project                    = "bon-transport-stg-07"
      + service                    = "iam.googleapis.com"
    }

  # google_project_service.api["iamcredentials"] must be replaced
-/+ resource "google_project_service" "api" {
      + disable_dependent_services = true
        disable_on_destroy         = true
      ~ id                         = "bon-transport-stg-007/iamcredentials.googleapis.com" -> (known after apply)
      ~ project                    = "bon-transport-stg-007" -> "bon-transport-stg-07" # forces replacement
        service                    = "iamcredentials.googleapis.com"
    }

  # google_project_service.api["logging"] must be replaced
-/+ resource "google_project_service" "api" {
      + disable_dependent_services = true
        disable_on_destroy         = true
      ~ id                         = "bon-transport-stg-007/logging.googleapis.com" -> (known after apply)
      ~ project                    = "bon-transport-stg-007" -> "bon-transport-stg-07" # forces replacement
        service                    = "logging.googleapis.com"
    }

  # google_project_service.api["monitoring"] must be replaced
-/+ resource "google_project_service" "api" {
      + disable_dependent_services = true
        disable_on_destroy         = true
      ~ id                         = "bon-transport-stg-007/monitoring.googleapis.com" -> (known after apply)
      ~ project                    = "bon-transport-stg-007" -> "bon-transport-stg-07" # forces replacement
        service                    = "monitoring.googleapis.com"
    }

  # google_project_service.api["serviceusage"] will be created
  + resource "google_project_service" "api" {
      + disable_dependent_services = true
      + disable_on_destroy         = true
      + id                         = (known after apply)
      + project                    = "bon-transport-stg-07"
      + service                    = "serviceusage.googleapis.com"
    }

  # google_project_service.api["stackdriver"] will be created
  + resource "google_project_service" "api" {
      + disable_dependent_services = true
      + disable_on_destroy         = true
      + id                         = (known after apply)
      + project                    = "bon-transport-stg-07"
      + service                    = "stackdriver.googleapis.com"
    }

  # google_project_service.api["storage-api"] will be created
  + resource "google_project_service" "api" {
      + disable_dependent_services = true
      + disable_on_destroy         = true
      + id                         = (known after apply)
      + project                    = "bon-transport-stg-07"
      + service                    = "storage-api.googleapis.com"
    }

  # module.vpc.module.vpc.google_compute_network.network will be created
  + resource "google_compute_network" "network" {
      + auto_create_subnetworks         = false
      + delete_default_routes_on_create = false
      + gateway_ipv4                    = (known after apply)
      + id                              = (known after apply)
      + mtu                             = 0
      + name                            = "transport-stg"
      + project                         = "bon-transport-stg-07"
      + routing_mode                    = "GLOBAL"
      + self_link                       = (known after apply)
    }

Plan: 15 to add, 0 to change, 4 to destroy.

Changes to Outputs:
  ~ vpn = {
        asn     = "13"
      ~ cr      = {
          ~ bgp                = [
              ~ {
                    advertise_mode       = "CUSTOM"
                    advertised_groups    = []
                  ~ advertised_ip_ranges = [
                      ~ {
                          ~ description = "" -> null
                            range       = "10.0.4.0/22"
                        },
                    ]
                    asn                  = 64513
                },
            ]
          ~ creation_timestamp = "2021-02-14T18:38:17.259-08:00" -> (known after apply)
          ~ description        = "" -> null
          ~ id                 = "projects/bon-transport-stg-007/regions/us-central1/routers/transport-stg" -> (known after apply)
            name               = "transport-stg"
          ~ network            = "https://www.googleapis.com/compute/v1/projects/bon-transport-stg-007/global/networks/transport-stg" -> "transport-stg"
          ~ project            = "bon-transport-stg-007" -> "bon-transport-stg-07"
          ~ region             = "us-central1" -> (known after apply)
          ~ self_link          = "https://www.googleapis.com/compute/v1/projects/bon-transport-stg-007/regions/us-central1/routers/transport-stg" -> (known after apply)
            timeouts           = null
        }
        gw      = "transport-stg"
      ~ project = "bon-transport-stg-007" -> "bon-transport-stg-07"
    }

Warning: Interpolation-only expressions are deprecated

  on .terraform/modules/vpc/modules/firewall-rules/main.tf line 18, in resource "google_compute_firewall" "rules":
  18:   for_each                = { for r in var.rules : "${r.name}" => r }

Terraform 0.11 and earlier required all non-constant expressions to be
provided via interpolation syntax, but this pattern is now deprecated. To
silence this warning, remove the "${ sequence from the start and the }"
sequence from the end of this expression, leaving just the inner expression.

Template interpolation syntax is still used to construct strings from
expressions when the template includes multiple interpolation sequences or a
mixture of literal strings and interpolations. This deprecation applies only
to templates that consist entirely of a single interpolation sequence.


------------------------------------------------------------------------

Note: You didn't specify an "-out" parameter to save this plan, so Terraform
can't guarantee that exactly these actions will be performed if
"terraform apply" is subsequently run.

time=2021-02-15T18:05:17Z level=error msg=Dependency /github/workspace/transport/prd of module /github/workspace/dept/squad-b/prd just finished with an error. Module /github/workspace/dept/squad-b/prd will have to return an error too. prefix=[/github/workspace/dept/squad-b/prd] 
time=2021-02-15T18:05:17Z level=error msg=Dependency /github/workspace/transport/prd of module /github/workspace/dept/squad-a/prd just finished with an error. Module /github/workspace/dept/squad-a/prd will have to return an error too. prefix=[/github/workspace/dept/squad-a/prd] 
time=2021-02-15T18:05:17Z level=error msg=Dependency /github/workspace/transport/prd of module /github/workspace/dept/squad-c/prd just finished with an error. Module /github/workspace/dept/squad-c/prd will have to return an error too. prefix=[/github/workspace/dept/squad-c/prd] 
Refreshing Terraform state in-memory prior to plan...
The refreshed state will be used to calculate this plan, but will not be
persisted to local or remote state storage.

Refreshing Terraform state in-memory prior to plan...
The refreshed state will be used to calculate this plan, but will not be
persisted to local or remote state storage.

Refreshing Terraform state in-memory prior to plan...
The refreshed state will be used to calculate this plan, but will not be
persisted to local or remote state storage.

google_folder.env: Refreshing state... [id=folders/150578772375]
google_folder.env: Refreshing state... [id=folders/354041018976]
google_folder.env: Refreshing state... [id=folders/889070619480]
google_folder.projects: Refreshing state... [id=folders/366493767935]
google_folder.projects: Refreshing state... [id=folders/452810046894]
google_folder.projects: Refreshing state... [id=folders/487920024190]

------------------------------------------------------------------------

------------------------------------------------------------------------

------------------------------------------------------------------------

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # google_project.env will be created
  + resource "google_project" "env" {
      + auto_create_network = false
      + billing_account     = "01473C-EEB311-01F68E"
      + folder_id           = "354041018976"
      + id                  = (known after apply)
      + name                = "bon-dept-squad-b-stg"
      + number              = (known after apply)
      + org_id              = (known after apply)
      + project_id          = "bon-dept-squad-b-stg-07"
      + skip_delete         = (known after apply)
    }

  # google_project_service.api["cloudbilling"] will be created
  + resource "google_project_service" "api" {
      + disable_dependent_services = true
      + disable_on_destroy         = true
      + id                         = (known after apply)
      + project                    = "bon-dept-squad-b-stg-07"
      + service                    = "cloudbilling.googleapis.com"
    }

  # google_project_service.api["cloudresourcemanager"] will be created
  + resource "google_project_service" "api" {
      + disable_dependent_services = true
      + disable_on_destroy         = true
      + id                         = (known after apply)
      + project                    = "bon-dept-squad-b-stg-07"
      + service                    = "cloudresourcemanager.googleapis.com"
    }

  # google_project_service.api["compute"] will be created
  + resource "google_project_service" "api" {
      + disable_dependent_services = true
      + disable_on_destroy         = true
      + id                         = (known after apply)
      + project                    = "bon-dept-squad-b-stg-07"
      + service                    = "compute.googleapis.com"
    }

  # google_project_service.api["dns"] will be created
  + resource "google_project_service" "api" {
      + disable_dependent_services = true
      + disable_on_destroy         = true
      + id                         = (known after apply)
      + project                    = "bon-dept-squad-b-stg-07"
      + service                    = "dns.googleapis.com"
    }

  # google_project_service.api["iam"] will be created
  + resource "google_project_service" "api" {
      + disable_dependent_services = true
      + disable_on_destroy         = true
      + id                         = (known after apply)
      + project                    = "bon-dept-squad-b-stg-07"
      + service                    = "iam.googleapis.com"
    }

  # google_project_service.api["iamcredentials"] will be created
  + resource "google_project_service" "api" {
      + disable_dependent_services = true
      + disable_on_destroy         = true
      + id                         = (known after apply)
      + project                    = "bon-dept-squad-b-stg-07"
      + service                    = "iamcredentials.googleapis.com"
    }

  # google_project_service.api["logging"] will be created
  + resource "google_project_service" "api" {
      + disable_dependent_services = true
      + disable_on_destroy         = true
      + id                         = (known after apply)
      + project                    = "bon-dept-squad-b-stg-07"
      + service                    = "logging.googleapis.com"
    }

  # google_project_service.api["monitoring"] will be created
  + resource "google_project_service" "api" {
      + disable_dependent_services = true
      + disable_on_destroy         = true
      + id                         = (known after apply)
      + project                    = "bon-dept-squad-b-stg-07"
      + service                    = "monitoring.googleapis.com"
    }

  # google_project_service.api["serviceusage"] will be created
  + resource "google_project_service" "api" {
      + disable_dependent_services = true
      + disable_on_destroy         = true
      + id                         = (known after apply)
      + project                    = "bon-dept-squad-b-stg-07"
      + service                    = "serviceusage.googleapis.com"
    }

  # google_project_service.api["stackdriver"] will be created
  + resource "google_project_service" "api" {
      + disable_dependent_services = true
      + disable_on_destroy         = true
      + id                         = (known after apply)
      + project                    = "bon-dept-squad-b-stg-07"
      + service                    = "stackdriver.googleapis.com"
    }

  # google_project_service.api["storage-api"] will be created
  + resource "google_project_service" "api" {
      + disable_dependent_services = true
      + disable_on_destroy         = true
      + id                         = (known after apply)
      + project                    = "bon-dept-squad-b-stg-07"
      + service                    = "storage-api.googleapis.com"
    }

  # module.vpc.module.vpc.google_compute_network.network will be created
  + resource "google_compute_network" "network" {
      + auto_create_subnetworks         = false
      + delete_default_routes_on_create = false
      + gateway_ipv4                    = (known after apply)
      + id                              = (known after apply)
      + mtu                             = 0
      + name                            = "dept-squad-b-stg"
      + project                         = "bon-dept-squad-b-stg-07"
      + routing_mode                    = "GLOBAL"
      + self_link                       = (known after apply)
    }

  # module.vpc.module.vpc.google_compute_shared_vpc_host_project.shared_vpc_host[0] will be created
  + resource "google_compute_shared_vpc_host_project" "shared_vpc_host" {
      + id      = (known after apply)
      + project = "bon-dept-squad-b-stg-07"
    }

Plan: 14 to add, 0 to change, 0 to destroy.

Warning: Interpolation-only expressions are deprecated

  on .terraform/modules/vpc/modules/firewall-rules/main.tf line 18, in resource "google_compute_firewall" "rules":
  18:   for_each                = { for r in var.rules : "${r.name}" => r }

Terraform 0.11 and earlier required all non-constant expressions to be
provided via interpolation syntax, but this pattern is now deprecated. To
silence this warning, remove the "${ sequence from the start and the }"
sequence from the end of this expression, leaving just the inner expression.

Template interpolation syntax is still used to construct strings from
expressions when the template includes multiple interpolation sequences or a
mixture of literal strings and interpolations. This deprecation applies only
to templates that consist entirely of a single interpolation sequence.


------------------------------------------------------------------------

Note: You didn't specify an "-out" parameter to save this plan, so Terraform
can't guarantee that exactly these actions will be performed if
"terraform apply" is subsequently run.


An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # google_project.env will be created
  + resource "google_project" "env" {
      + auto_create_network = false
      + billing_account     = "01473C-EEB311-01F68E"
      + folder_id           = "150578772375"
      + id                  = (known after apply)
      + name                = "bon-dept-squad-a-stg"
      + number              = (known after apply)
      + org_id              = (known after apply)
      + project_id          = "bon-dept-squad-a-stg-07"
      + skip_delete         = (known after apply)
    }

  # google_project_service.api["cloudbilling"] will be created
  + resource "google_project_service" "api" {
      + disable_dependent_services = true
      + disable_on_destroy         = true
      + id                         = (known after apply)
      + project                    = "bon-dept-squad-a-stg-07"
      + service                    = "cloudbilling.googleapis.com"
    }

  # google_project_service.api["cloudresourcemanager"] will be created
  + resource "google_project_service" "api" {
      + disable_dependent_services = true
      + disable_on_destroy         = true
      + id                         = (known after apply)
      + project                    = "bon-dept-squad-a-stg-07"
      + service                    = "cloudresourcemanager.googleapis.com"
    }

  # google_project_service.api["compute"] will be created
  + resource "google_project_service" "api" {
      + disable_dependent_services = true
      + disable_on_destroy         = true
      + id                         = (known after apply)
      + project                    = "bon-dept-squad-a-stg-07"
      + service                    = "compute.googleapis.com"
    }

  # google_project_service.api["dns"] will be created
  + resource "google_project_service" "api" {
      + disable_dependent_services = true
      + disable_on_destroy         = true
      + id                         = (known after apply)
      + project                    = "bon-dept-squad-a-stg-07"
      + service                    = "dns.googleapis.com"
    }

  # google_project_service.api["iam"] will be created
  + resource "google_project_service" "api" {
      + disable_dependent_services = true
      + disable_on_destroy         = true
      + id                         = (known after apply)
      + project                    = "bon-dept-squad-a-stg-07"
      + service                    = "iam.googleapis.com"
    }

  # google_project_service.api["iamcredentials"] will be created
  + resource "google_project_service" "api" {
      + disable_dependent_services = true
      + disable_on_destroy         = true
      + id                         = (known after apply)
      + project                    = "bon-dept-squad-a-stg-07"
      + service                    = "iamcredentials.googleapis.com"
    }

  # google_project_service.api["logging"] will be created
  + resource "google_project_service" "api" {
      + disable_dependent_services = true
      + disable_on_destroy         = true
      + id                         = (known after apply)
      + project                    = "bon-dept-squad-a-stg-07"
      + service                    = "logging.googleapis.com"
    }

  # google_project_service.api["monitoring"] will be created
  + resource "google_project_service" "api" {
      + disable_dependent_services = true
      + disable_on_destroy         = true
      + id                         = (known after apply)
      + project                    = "bon-dept-squad-a-stg-07"
      + service                    = "monitoring.googleapis.com"
    }

  # google_project_service.api["serviceusage"] will be created
  + resource "google_project_service" "api" {
      + disable_dependent_services = true
      + disable_on_destroy         = true
      + id                         = (known after apply)
      + project                    = "bon-dept-squad-a-stg-07"
      + service                    = "serviceusage.googleapis.com"
    }

  # google_project_service.api["stackdriver"] will be created
  + resource "google_project_service" "api" {
      + disable_dependent_services = true
      + disable_on_destroy         = true
      + id                         = (known after apply)
      + project                    = "bon-dept-squad-a-stg-07"
      + service                    = "stackdriver.googleapis.com"
    }

  # google_project_service.api["storage-api"] will be created
  + resource "google_project_service" "api" {
      + disable_dependent_services = true
      + disable_on_destroy         = true
      + id                         = (known after apply)
      + project                    = "bon-dept-squad-a-stg-07"
      + service                    = "storage-api.googleapis.com"
    }

  # module.vpc.module.vpc.google_compute_network.network will be created
  + resource "google_compute_network" "network" {
      + auto_create_subnetworks         = false
      + delete_default_routes_on_create = false
      + gateway_ipv4                    = (known after apply)
      + id                              = (known after apply)
      + mtu                             = 0
      + name                            = "dept-squad-a-stg"
      + project                         = "bon-dept-squad-a-stg-07"
      + routing_mode                    = "GLOBAL"
      + self_link                       = (known after apply)
    }

  # module.vpc.module.vpc.google_compute_shared_vpc_host_project.shared_vpc_host[0] will be created
  + resource "google_compute_shared_vpc_host_project" "shared_vpc_host" {
      + id      = (known after apply)
      + project = "bon-dept-squad-a-stg-07"
    }

Plan: 14 to add, 0 to change, 0 to destroy.

Warning: Interpolation-only expressions are deprecated

  on .terraform/modules/vpc/modules/firewall-rules/main.tf line 18, in resource "google_compute_firewall" "rules":
  18:   for_each                = { for r in var.rules : "${r.name}" => r }

Terraform 0.11 and earlier required all non-constant expressions to be
provided via interpolation syntax, but this pattern is now deprecated. To
silence this warning, remove the "${ sequence from the start and the }"
sequence from the end of this expression, leaving just the inner expression.

Template interpolation syntax is still used to construct strings from
expressions when the template includes multiple interpolation sequences or a
mixture of literal strings and interpolations. This deprecation applies only
to templates that consist entirely of a single interpolation sequence.


------------------------------------------------------------------------

Note: You didn't specify an "-out" parameter to save this plan, so Terraform
can't guarantee that exactly these actions will be performed if
"terraform apply" is subsequently run.


An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # google_project.env will be created
  + resource "google_project" "env" {
      + auto_create_network = false
      + billing_account     = "01473C-EEB311-01F68E"
      + folder_id           = "889070619480"
      + id                  = (known after apply)
      + name                = "bon-dept-squad-c-stg"
      + number              = (known after apply)
      + org_id              = (known after apply)
      + project_id          = "bon-dept-squad-c-stg-07"
      + skip_delete         = (known after apply)
    }

  # google_project_service.api["cloudbilling"] will be created
  + resource "google_project_service" "api" {
      + disable_dependent_services = true
      + disable_on_destroy         = true
      + id                         = (known after apply)
      + project                    = "bon-dept-squad-c-stg-07"
      + service                    = "cloudbilling.googleapis.com"
    }

  # google_project_service.api["cloudresourcemanager"] will be created
  + resource "google_project_service" "api" {
      + disable_dependent_services = true
      + disable_on_destroy         = true
      + id                         = (known after apply)
      + project                    = "bon-dept-squad-c-stg-07"
      + service                    = "cloudresourcemanager.googleapis.com"
    }

  # google_project_service.api["compute"] will be created
  + resource "google_project_service" "api" {
      + disable_dependent_services = true
      + disable_on_destroy         = true
      + id                         = (known after apply)
      + project                    = "bon-dept-squad-c-stg-07"
      + service                    = "compute.googleapis.com"
    }

  # google_project_service.api["dns"] will be created
  + resource "google_project_service" "api" {
      + disable_dependent_services = true
      + disable_on_destroy         = true
      + id                         = (known after apply)
      + project                    = "bon-dept-squad-c-stg-07"
      + service                    = "dns.googleapis.com"
    }

  # google_project_service.api["iam"] will be created
  + resource "google_project_service" "api" {
      + disable_dependent_services = true
      + disable_on_destroy         = true
      + id                         = (known after apply)
      + project                    = "bon-dept-squad-c-stg-07"
      + service                    = "iam.googleapis.com"
    }

  # google_project_service.api["iamcredentials"] will be created
  + resource "google_project_service" "api" {
      + disable_dependent_services = true
      + disable_on_destroy         = true
      + id                         = (known after apply)
      + project                    = "bon-dept-squad-c-stg-07"
      + service                    = "iamcredentials.googleapis.com"
    }

  # google_project_service.api["logging"] will be created
  + resource "google_project_service" "api" {
      + disable_dependent_services = true
      + disable_on_destroy         = true
      + id                         = (known after apply)
      + project                    = "bon-dept-squad-c-stg-07"
      + service                    = "logging.googleapis.com"
    }

  # google_project_service.api["monitoring"] will be created
  + resource "google_project_service" "api" {
      + disable_dependent_services = true
      + disable_on_destroy         = true
      + id                         = (known after apply)
      + project                    = "bon-dept-squad-c-stg-07"
      + service                    = "monitoring.googleapis.com"
    }

  # google_project_service.api["serviceusage"] will be created
  + resource "google_project_service" "api" {
      + disable_dependent_services = true
      + disable_on_destroy         = true
      + id                         = (known after apply)
      + project                    = "bon-dept-squad-c-stg-07"
      + service                    = "serviceusage.googleapis.com"
    }

  # google_project_service.api["stackdriver"] will be created
  + resource "google_project_service" "api" {
      + disable_dependent_services = true
      + disable_on_destroy         = true
      + id                         = (known after apply)
      + project                    = "bon-dept-squad-c-stg-07"
      + service                    = "stackdriver.googleapis.com"
    }

  # google_project_service.api["storage-api"] will be created
  + resource "google_project_service" "api" {
      + disable_dependent_services = true
      + disable_on_destroy         = true
      + id                         = (known after apply)
      + project                    = "bon-dept-squad-c-stg-07"
      + service                    = "storage-api.googleapis.com"
    }

  # module.vpc.module.vpc.google_compute_network.network will be created
  + resource "google_compute_network" "network" {
      + auto_create_subnetworks         = false
      + delete_default_routes_on_create = false
      + gateway_ipv4                    = (known after apply)
      + id                              = (known after apply)
      + mtu                             = 0
      + name                            = "dept-squad-c-stg"
      + project                         = "bon-dept-squad-c-stg-07"
      + routing_mode                    = "GLOBAL"
      + self_link                       = (known after apply)
    }

  # module.vpc.module.vpc.google_compute_shared_vpc_host_project.shared_vpc_host[0] will be created
  + resource "google_compute_shared_vpc_host_project" "shared_vpc_host" {
      + id      = (known after apply)
      + project = "bon-dept-squad-c-stg-07"
    }

Plan: 14 to add, 0 to change, 0 to destroy.

Warning: Interpolation-only expressions are deprecated

  on .terraform/modules/vpc/modules/firewall-rules/main.tf line 18, in resource "google_compute_firewall" "rules":
  18:   for_each                = { for r in var.rules : "${r.name}" => r }

Terraform 0.11 and earlier required all non-constant expressions to be
provided via interpolation syntax, but this pattern is now deprecated. To
silence this warning, remove the "${ sequence from the start and the }"
sequence from the end of this expression, leaving just the inner expression.

Template interpolation syntax is still used to construct strings from
expressions when the template includes multiple interpolation sequences or a
mixture of literal strings and interpolations. This deprecation applies only
to templates that consist entirely of a single interpolation sequence.


------------------------------------------------------------------------

Note: You didn't specify an "-out" parameter to save this plan, so Terraform
can't guarantee that exactly these actions will be performed if
"terraform apply" is subsequently run.

time=2021-02-15T18:05:23Z level=error msg=Encountered the following errors:
Cannot process module Module /github/workspace/dept/squad-b/prd (excluded: false, dependencies: [/github/workspace/dept/squad-b/folder, /github/workspace/transport/prd]) because one of its dependencies, Module /github/workspace/transport/prd (excluded: false, dependencies: [/github/workspace/transport/folder]), finished with an error: Hit multiple errors:
Hit multiple errors:
exit status 1
Hit multiple errors:
Hit multiple errors:
exit status 1
Cannot process module Module /github/workspace/dept/squad-c/prd (excluded: false, dependencies: [/github/workspace/dept/squad-c/folder, /github/workspace/transport/prd]) because one of its dependencies, Module /github/workspace/transport/prd (excluded: false, dependencies: [/github/workspace/transport/folder]), finished with an error: Hit multiple errors:
Hit multiple errors:
exit status 1
Cannot process module Module /github/workspace/dept/squad-b/dev (excluded: false, dependencies: [/github/workspace/dept/squad-b/folder, /github/workspace/transport/dev]) because one of its dependencies, Module /github/workspace/transport/dev (excluded: false, dependencies: [/github/workspace/transport/folder]), finished with an error: Hit multiple errors:
Hit multiple errors:
exit status 1
Cannot process module Module /github/workspace/dept/squad-a/dev (excluded: false, dependencies: [/github/workspace/dept/squad-a/folder, /github/workspace/transport/dev]) because one of its dependencies, Module /github/workspace/transport/dev (excluded: false, dependencies: [/github/workspace/transport/folder]), finished with an error: Hit multiple errors:
Hit multiple errors:
exit status 1
Hit multiple errors:
Hit multiple errors:
exit status 1
Cannot process module Module /github/workspace/dept/squad-a/prd (excluded: false, dependencies: [/github/workspace/dept/squad-a/folder, /github/workspace/transport/prd]) because one of its dependencies, Module /github/workspace/transport/prd (excluded: false, dependencies: [/github/workspace/transport/folder]), finished with an error: Hit multiple errors:
Hit multiple errors:
exit status 1
Cannot process module Module /github/workspace/dept/squad-c/dev (excluded: false, dependencies: [/github/workspace/dept/squad-c/folder, /github/workspace/transport/dev]) because one of its dependencies, Module /github/workspace/transport/dev (excluded: false, dependencies: [/github/workspace/transport/folder]), finished with an error: Hit multiple errors:
Hit multiple errors:
exit status 1
```

</details>

*Workflow: `Plan Boniface GCP Org`, Action: `bonifaceltdterragrunt-github-actions3`, Working Directory: `.`, Workspace: `default`*
